Теперь поработаем с данными о поездках на такси в Нью-Йорке, где также имеется информация о погодных условиях и выходных днях.


* pickup_dt — период с точностью до часа
* pickup_month — месяц
* borough — район Нью-Йорка, из которого был сделан заказ (5 районов + аэропорт)
* pickups — число поездок за период (час)
* hday – является ли день праздничным/выходным; Y — да,  N — нет
* spd – скорость ветра в милях в час
* vsb – видимость
* temp – температура в градусах Фаренгейта
* dewp – точка росы по Фаренгейту
* slp – давление
* pcp_01 – количество осадков за час
* pcp_06 – количество осадков за 6 часов
* pcp_24 – количество осадков за 24 часа
* sd – глубина снега в дюймах


Импортирую библиотеку pandas, а затем загружу датасет 2_taxi_nyc. 
Результат сохраню в переменную taxi

In [36]:
import pandas as pd

In [37]:
taxi = pd.read_csv('https://stepik.org/media/attachments/lesson/360340/2_taxi_nyc.csv')

In [38]:
taxi.head(5)
# Видим, чио названия колонок "pcp 01", "pcp 06" и "pcp 24" занесены с пробелами.(это не позволит использовать методы)

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp 01,pcp 06,pcp 24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0

In [39]:
taxi.shape
# Проверю c помощью атрибута, сколько всего строк и столбцов имеется в датасете.

(29101, 14)

In [40]:
taxi.info()
# Узнаю с помощью функции подробную информацию. Посмотрю на типы переменных, проверю все ли из них считались правильно.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29101 entries, 0 to 29100
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   pickup_dt     29101 non-null  object
 1   pickup_month  29101 non-null  object
 2   borough       26058 non-null  object
 3   pickups       29101 non-null  int64
 4   hday          29101 non-null  object
 5   spd           29101 non-null  float64
 6   vsb           29101 non-null  float64
 7   temp          29101 non-null  float64
 8   dewp          29101 non-null  float64
 9   slp           29101 non-null  float64
 10  pcp 01        29101 non-null  float64
 11  pcp 06        29101 non-null  float64
 12  pcp 24        29101 non-null  float64
 13  sd            29101 non-null  float64
dtypes: float64(9), int64(1), object(4)
memory usage: 3.1+ MB

In [41]:
taxi.dtypes.value_counts()
# С помощью функции value_couts(), посчитал количество уникальных данных (типов данных в датафрейме)

float64    9
object     4
int64      1
dtype: int64

In [42]:
taxi.rename(columns={'pcp 01' : 'pcp_01', 'pcp 06' : 'pcp_06', 'pcp 24' : 'pcp_24'})
# taxi =  Переименовал названия колонок. Данный метод подходит для малого количества изменяемых колонок.

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp_01,pcp_06,pcp_24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29096,2015-06-30 23:00:00,Jun,EWR,0,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29097,2015-06-30 23:00:00,Jun,Manhattan,3828,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29098,2015-06-30 23:00:00,Jun,Queens,580,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29099,2015-06-30 23:00:00,Jun,Staten Island,0,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29100,2015-06-30 23:00:00,Jun,NaN,3,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0

Метод replace() возвращает копию строки, в которой все вхождения подстроки заменяются другой подстрокой.
* str.replace(old, new [count])
 
Метод в Python может принимать 3 параметра:
* old ‒ старая подстрока, которую нужно заменить;
* new ‒ новая подстрока, которая заменит старую подстроку;
* count (необязательно) ‒ сколько раз вы хотите заменить старую подстроку новой. 

Примечание: Если число не указано, метод заменяет все вхождения старой подстроки новой.

In [43]:
def underscore_rename(name):
    return name.replace(' ', '_')
# создал функцию с методом replace

In [44]:
taxi = taxi.rename(columns=underscore_rename)
taxi

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp_01,pcp_06,pcp_24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29096,2015-06-30 23:00:00,Jun,EWR,0,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29097,2015-06-30 23:00:00,Jun,Manhattan,3828,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29098,2015-06-30 23:00:00,Jun,Queens,580,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29099,2015-06-30 23:00:00,Jun,Staten Island,0,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29100,2015-06-30 23:00:00,Jun,NaN,3,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0

Узнаю сколько записей (строк) в датафрейме относятся к району Манхэттен (Manhattan). 
Получить ответ на данный вопрос можно тремя известными мне методами.

In [45]:
taxi.query("borough == 'Manhattan'") \
    .shape[0]

4343

In [46]:
taxi.groupby('borough') \
    .agg({'hday' : 'count'}) # удобно использовать как словарь, ключи это названия колонок,а значение это функция которую применяем

# индекс это значения в колонке 'borough' а hday теперь отображает количество повторений в каждой из групп
# в данном случае это не самое удобное решение

               hday
borough
Bronx          4343
Brooklyn       4343
EWR            4343
Manhattan      4343
Queens         4343
Staten Island  4343

In [47]:
taxi.borough.value_counts()
# простой и удобный метод

Bronx            4343
Brooklyn         4343
EWR              4343
Manhattan        4343
Queens           4343
Staten Island    4343
Name: borough, dtype: int64

Следующая задача: выяснить, из какого района было совершено наибольшее количество поездок за весь период. 

Для начала, посчитаю общее количество поездок (pickups), без группировки

In [48]:
taxi.pickups.sum()
# рассчитал общее количество поездок

14265773

Теперь сгруппирую данные по району (borough) и укажу, из какого пункта было совершено больше всего поездок.

In [49]:
taxi.groupby('borough') \
    .agg({'pickups' : 'sum'}) \
    .idxmax()         # bolshee znachenie

pickups    Manhattan
dtype: object

Сохраню название района с наименьшим числом поездок в переменную min_pickups .

In [50]:
min_pickups = taxi.groupby('borough') \
                    .agg({'pickups' : 'sum'}) \
                    .idxmin()
min_pickups

pickups    EWR
dtype: object

Продолжаю изучение данных и посмотрю на число поездок в выходные дни. Сгруппирую данные по двум признакам: району города и является ли день выходным (колонки borough и hday). Посмотрю среднее число поездок, и выберу районы, из которых по выходным в среднем поступает больше заказов, чем в обычные дни.

In [70]:
taxi.groupby(['borough', 'hday']) \
    .agg({'pickups' : 'mean'}) \
    .sort_values('pickups')

# mean - расчет среднего значения
# можем увидеть название рай-на, выходной или будний день и среднее количество поездок
# В EWR и Queens, среднее число поездок больше в выходные чем в обычные дни.

                        pickups
borough       hday
EWR           N        0.023467
              Y        0.041916
Staten Island Y        1.497006
              N        1.606082
Bronx         Y       48.065868
              N       50.771073
Queens        N      308.899904
              Y      320.730539
Brooklyn      Y      527.011976
              N      534.727969
Manhattan     Y     2035.928144
              N     2401.302921

Для каждого района посчитаю число поездок по месяцам. Отсортирую полученные значения по убыванию и сохраню результирующий датафрейм в pickups_by_mon_bor.
Итоговый датасет будет состоять из 3-х колонок – pickup_month, borough, pickups

In [73]:
pickups_by_mon_bor = taxi.groupby(['borough', 'pickup_month'], as_index=False) \
                            .agg({'pickups' : 'sum'}) \
                            .sort_values('pickups', ascending=False)
pickups_by_mon_bor

# as_index=False - пандос будет считать колонки а не индекс
# ascending=False - выводит данные от большего к меньшему

          borough pickup_month  pickups
21      Manhattan          Jun  1995388
23      Manhattan          May  1888800
19      Manhattan          Feb  1718571
22      Manhattan          Mar  1661261
18      Manhattan          Apr  1648278
20      Manhattan          Jan  1455543
9        Brooklyn          Jun   482466
11       Brooklyn          May   476087
6        Brooklyn          Apr   378095
10       Brooklyn          Mar   346726
7        Brooklyn          Feb   328650
8        Brooklyn          Jan   309011
27         Queens          Jun   286311
29         Queens          May   275893
28         Queens          Mar   219561
24         Queens          Apr   216857
25         Queens          Feb   185695
26         Queens          Jan   159211
5           Bronx          May    53037
3           Bronx          Jun    49006
0           Bronx          Apr    34617
4           Bronx          Mar    32232
1           Bronx          Feb    28694
2           Bronx          Jan    22461
33  Staten Island          Jun     1673
35  Staten Island          May     1517
30  Staten Island          Apr     1068
34  Staten Island          Mar      975
31  Staten Island          Feb      903
32  Staten Island          Jan      821
15            EWR          Jun       29
17            EWR          May       27
16            EWR          Mar       14
13            EWR          Feb       14
14            EWR          Jan       11
12            EWR          Apr       10

Теперь задача посложнее. Попрактикусь в написании функций и их применении к датафрейму.

Поскольку данные о поездках в Нью-Йорке, температура представлена в градусах Фаренгейта. 

Напишу функцию temp_to_celcius, которая получает на вход колонку с температурой в °F, и возвращает значения, переведенные в градусы Цельсия.

Формула:

 Celsius = (F - 32) * 5 / 9

In [82]:
def temp_to_celcius(temp):
    return(temp - 32) * 5 / 9

In [86]:
temp_to_celcius(taxi.temp)

0        -1.111111
1        -1.111111
2        -1.111111
3        -1.111111
4        -1.111111
           ...
29096    23.888889
29097    23.888889
29098    23.888889
29099    23.888889
29100    23.888889
Name: temp, Length: 29101, dtype: float64